const privateMatchRecords = [
  { 
    id: "prv_1", 
    title: "5/23 🦑プラベ", 
    datetime: "2026-05-23T21:00", 
    members: [].join("\n"), 
    content: `
  <b></b> 
  ` 
  },
  { 
    id: "prv_2", 
    title: "8/22 👑姫スプラ", 
    datetime: "2026-08-22T21:00", 
    members: [
      "たちばな", "あかる", "せいや", "となか",
      "ひとし", "やすもと", "ちんちら", "あんでぃ"
    ].join("\n"), 
    // ★ 複数試合のチーム分けを設定する例（設定しないプラベは書かなくてOK）
    matches: [
  {
    round: "第1試合",
    alpha: ["あんでぃ", "ちんちら", "となか", "ひとし"],
    beta: ["あかる", "せいや", "たかぎし", "やすもと"],
    spectators: ["たちばな"]
  },
  {
    round: "第2試合",
    alpha: ["あんでぃ", "たちばな", "ちんちら", "ひとし"],
    beta: ["せいや", "たかぎし", "となか", "やすもと"],
    spectators: ["あかる"]
  },
  {
    round: "第3試合",
    alpha: ["あんでぃ", "ちんちら", "となか", "ひとし"],
    beta: ["あかる", "たかぎし", "たちばな", "やすもと"],
    spectators: ["せいや"]
  },
  {
    round: "第4試合",
    alpha: ["あかる", "あんでぃ", "ちんちら", "ひとし"],
    beta: ["せいや", "たかぎし", "たちばな", "やすもと"],
    spectators: ["となか"]
  },
  {
    round: "第5試合",
    alpha: ["あんでぃ", "せいや", "たちばな", "ちんちら"],
    beta: ["あかる", "たかぎし", "となか", "やすもと"],
    spectators: ["ひとし"]
  },
  {
    round: "第6試合",
    alpha: ["たちばな", "となか", "ひとし", "やすもと"],
    beta: ["あかる", "あんでぃ", "せいや", "ちんちら"],
    spectators: ["たかぎし"]
  },
  {
    round: "第7試合",
    alpha: ["あかる", "となか", "ひとし", "やすもと"],
    beta: ["せいや", "たかぎし", "たちばな", "ちんちら"],
    spectators: ["あんでぃ"]
  },
  {
    round: "第8試合",
    alpha: ["あかる", "たちばな", "ひとし", "やすもと"],
    beta: ["あんでぃ", "せいや", "たかぎし", "となか"],
    spectators: ["ちんちら"]
  },
  {
    round: "第9試合",
    alpha: ["あかる", "あんでぃ", "ちんちら", "ひとし"],
    beta: ["せいや", "たかぎし", "たちばな", "となか"],
    spectators: ["やすもと"]
  }
],
    content: `
  <b>【👑姫スプラ】</b> 
      ルール：ガチホコ、ガチヤグラ
      チームでひとり姫を選出。
      ホコ運びやヤグラ乗りは姫のみ可能。
      姫の武器はワカバ固定でメインやサブによるキルは禁止(ホコショはOK)
      ホコ割りやスペシャル使用は可。

  <b>【🎯ドラフトスプラ】(時間があれば)</b>
      ルール：ガチエリア、ガチヤグラ
      武器：ランダム
      チームリーダーを２人決めて、それぞれメンバーを選出。
      どんなチームを作るかはリーダー次第！
  ` 
  }
];