  const privateMatchRecords = [
  { 
    id: "prv_1", 
    title: "5/23 🦑プラベ", 
    datetime: "2026-05-23T21:00", 
    members: [
    ].join("\n"), 
    content: `
  <b></b> 

  ` 
  }
  ,
  { 
    id: "prv_2", 
    title: "8/22 👑姫スプラ", 
    datetime: "2026-08-22T21:00", 
    members: [
      "たちばな", "あかる", "せいや", "となか",
      "ひとし", "やすもと", "ちんちら", "あんでぃ", "たかぎし"
    ].join("\n"), 
    content: `
  <b>【👑姫スプラ】</b> 
      ルール：ガチホコ、ガチヤグラ
      チームでひとり姫を選出。
      ホコ運びやヤグラ乗りは姫のみ可能。
      姫の武器はワカバ固定でメインやサブによるキルは禁止(ホコショはOK)
      ホコ割りやスペシャル使用は可。

  <b>【🎯ドラフトスプラ】(時間があれば)</b>
      ルール：ガチエリア、ガチヤグラ
      武器：ランダム
      チームリーダーを２人決めて、それぞれメンバーを選出。
      どんなチームを作るかはリーダー次第！
  ` 
  }
];