const privateMatchRecords = [
  { 
    id: "prv_1", 
    title: "5/23 🦑プラベ", 
    datetime: "2026-05-23T21:00", 
    members: [].join("\n"), 
    content: `
  <b></b> 
  ` 
  },
  { 
    id: "prv_2", 
    title: "8/22 👑姫スプラ", 
    datetime: "2026-08-22T21:00", 
    members: [
      "たちばな", "あかる", "せいや", "となか",
      "ひとし", "やすもと", "ちんちら", "あんでぃ"
    ].join("\n"), 
    // ★ 複数試合のチーム分けを設定する例（設定しないプラベは書かなくてOK）
    matches: [
  {
    round: "β勝利：ヤグラ",
    alpha: ["👑あんでぃ", "ちんちら", "となか", "ひとし"],
    beta: ["👑あかる", "せいや", "たかぎし", "やすもと"],
    spectators: ["たちばな"]
  },
  {
    round: "α勝利：ヤグラ",
    alpha: ["👑あんでぃ", "たちばな", "ちんちら", "ひとし"],
    beta: ["せいや", "👑くまこ", "となか", "やすもと"],
    spectators: ["あかる", "たかぎし"]
  },
  {
    round: "β勝利：ヤグラ",
    alpha: ["あかる", "たかぎし", "👑たちばな", "やすもと"],
    beta: ["👑あんでぃ", "ちんちら", "となか", "ひとし"],
    spectators: ["せいや"]
  },
  {
    round: "β勝利：ヤグラ",
    alpha: ["👑せいや", "たかぎし", "たちばな", "やすもと"],
    beta: ["あかる", "あんでぃ", "👑ちんちら", "ひとし"],
    spectators: ["となか"]
  },
  {
    round: "α勝利：ホコ",
    alpha: ["あんでぃ", "あかる", "👑たちばな", "ちんちら"],
    beta: ["くまこ", "👑たかぎし", "となか", "やすもと"],
    spectators: ["ひとし", "せいや"]
  },
  {
    round: "勝利：ホコ",
    alpha: ["せいや", "たかぎし", "たちばな", "あかる"],
    beta: ["くまこ", "となか", "ひとし", "やすもと"],
    spectators: ["あんでぃ", "ちんちら"]
  },
  {
    round: "α勝利：ホコ",
    alpha: ["あかる", "たちばな", "ひとし", "👑やすもと"],
    beta: ["あんでぃ", "せいや", "👑たかぎし", "となか"],
    spectators: ["ちんちら"]
  },
  {
    round: "α勝利：ホコ",
    alpha: ["せいや", "たかぎし", "たちばな", "👑となか"],
    beta: ["👑あかる", "あんでぃ", "ちんちら", "ひとし"],
    spectators: ["やすもと"]
  }
],
    content: `
  <b>【👑姫スプラ】</b> 
      ルール：ガチホコ、ガチヤグラ
      チームでひとり姫を選出。
      ホコ運びやヤグラ乗りは姫のみ可能。
      姫の武器はワカバ固定でメインやサブによるキルは禁止(ホコショはOK)
      ホコ割りやスペシャル使用は可。

  <b>【🎯ドラフトスプラ】(時間があれば)</b>
      ルール：ガチエリア、ガチヤグラ
      武器：ランダム
      チームリーダーを２人決めて、それぞれメンバーを選出。
      どんなチームを作るかはリーダー次第！
  ` 
  }
];